mdhardenburgh/Blinky/Packages/.cache/NXP.MK02F12810_DFP.12.0.0.pdsc
    <condition id="device.MK02F12810_AND_driver.common_AND_driver.uart">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK02F12810_AND_CMSIS_Include_core_cm4">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="device.MK02F12810_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.dspi_edma">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK02F12810_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.i2c_edma">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK02F12810_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.uart_edma">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK02F12810_AND_device.MK02F12810_CMSIS_AND_driver.clock">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MK02F12810_startup"/>
    </condition>
    <condition id="device.MK02F12810_AND_driver.dspi_AND_driver.edma">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK02F12810_AND_driver.common_AND_driver.dmamux">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK02F12810_AND_driver.edma_AND_driver.i2c">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK02F12810_AND_driver.edma_AND_driver.uart">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK02F12810_AND_utility.debug_console">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MK02F12810_AND_component.serial_manager_AND_driver.common">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK02F12810_AND_component.lists_AND_driver.common_AND_utility.debug_console">
      <accept Dname="MK02FN64???10*" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MK02F12810" Cversion="1.0.0" condition="device.MK02F12810_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MK02F12810_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.port_AND_driver.smc_AND_driver.uart_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.MK02F12810_AND_driver.edma">
      <description/>
      <files>
        <file category="header" attr="config" name="template/RTE_Device.h"/>
      </files>
    </component>
